feat: fixing error deployment
